Desty-Gizmo/DG376/Software/DG376_STM32L011K4T/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR_CTRL_Pin GPIO_PIN_0
#define MOTOR_CTRL_GPIO_Port GPIOA
#define RGB_LED_EN_Pin GPIO_PIN_1
#define RGB_LED_EN_GPIO_Port GPIOA
#define VIBRATION_EN_Pin GPIO_PIN_2
#define VIBRATION_EN_GPIO_Port GPIOA
#define LED_0_Pin GPIO_PIN_3
#define LED_0_GPIO_Port GPIOA
#define LED_1_Pin GPIO_PIN_4
#define LED_1_GPIO_Port GPIOA
#define LED_2_Pin GPIO_PIN_5
#define LED_2_GPIO_Port GPIOA
#define LED_3_Pin GPIO_PIN_6
#define LED_3_GPIO_Port GPIOA
#define LED_4_Pin GPIO_PIN_7
#define LED_4_GPIO_Port GPIOA
#define LED_R_Pin GPIO_PIN_8
#define LED_R_GPIO_Port GPIOA
#define LED_G_Pin GPIO_PIN_9
#define LED_G_GPIO_Port GPIOA
#define LED_B_Pin GPIO_PIN_10
#define LED_B_GPIO_Port GPIOA
#define CNT_START_Pin GPIO_PIN_11
#define CNT_START_GPIO_Port GPIOA
#define CNT_RST_Pin GPIO_PIN_12
#define CNT_RST_GPIO_Port GPIOA
#define USR_BTN_Pin GPIO_PIN_15
#define USR_BTN_GPIO_Port GPIOA
#define S_10_SELECT_Pin GPIO_PIN_4
#define S_10_SELECT_GPIO_Port GPIOB
#define S_20_SELECT_Pin GPIO_PIN_5
#define S_20_SELECT_GPIO_Port GPIOB
#define S_30_SELECT_Pin GPIO_PIN_6
#define S_30_SELECT_GPIO_Port GPIOB
#define S_60_SELECT_Pin GPIO_PIN_7
#define S_60_SELECT_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
